<?php
/* array_merge() 将一个或多个数组的单元合并起来，一个数组中的值附加在前一个数组的后面。返回作为结果的数组。

如果输入的数组中有相同的字符串键名，则该键名后面的值将覆盖前一个值。然而，如果数组包含数字键名，后面的值将不会覆盖原来的值，而是附加到后面。

如果只给了一个数组并且该数组是数字索引的，则键名会以连续方式重新索引。 */

//索引数组是合并
$arr1 = [1,2,3,4,5];
$arr2 = [6,7,8,9,10];
print_r(array_merge($arr1,$arr2));
//关联数组
$arr3 = ['name' => 'Sam','age' => 20];
$arr4 = ['name' => 'Gill','age' => 30];
print_r(array_merge($arr3,$arr4));
//带有数字索引的
$arr5 = ['name' => 'Sam','age' => 20,1 => 1];
$arr6 = ['name' => 'Gill','age' => 30,1 => 2];
print_r(array_merge($arr5,$arr6));